Repository: maabou512/ospo_paper2021
Catalog: LFResearch_OSPO_Report Folder/omegaT_Rainbow/pack1/pack1-level2.tmx
Source language: en_us
Languages: ja_jp

source: In a world where software has eaten everything else, and organizations large and small strongly prefer OSS, expertise on open source becomes integral to creating great products and product experiences, be it at the product layer (media, communications) or in the infrastructure that supports the product.
ja_jp: ソフトウェアがあらゆるものを飲みこみ、組織の大小を問わず OSS が強く好まれる世界では、製品的なレイヤ(メディア、通信)であれ、製品的なものを下支えするインフラレイヤであれ、オープンソースに関する専門的知識が優れた製品、そのエクスペリエンスを生み出すために不可欠なものとなります。

source: In addition, organizations that create and launch open source projects establish broad credibility in the open source community; the possibility of working on open source technology is attractive to many developers.
ja_jp: さらに、オープンソース プロジェクトを1から立ち上げる組織は、オープンソース コミュニティにおいて幅広い信頼性を確立しています。オープンソースの技術に取り組むことで広がる可能性は、 多くの開発者にとって魅力的なのです。

source: In addition, the OSPO is supported by several OSS legal experts.
ja_jp: さらに、OSPO は数名の OSS に関する法律専門家たちからの支援を受けています。

source: In all cases, however, organizations in Stage 1 recognize that OSS is a key part of their business and technology strategy.
ja_jp: しかし、すべての場合において、ステージ1の段階にいる組織は、OSS がビジネス戦略およびテクノロジー戦略の重要な部分であることを認識しています。

source: In areas especially relevant to Bloomberg infrastructure needs, such as indexing, machine learning, visualization, and the core JavaScript/Node.js language for middleware and presentation layers, the company’s engineers have become project leaders and key commi tters.
ja_jp: 同社インフラにとって特に重要となる、Indexing、機械学習、Visualization（可視化）、ミドルウェアやプレゼンテーションレイヤ用のコアとなるJavaScript/Node.jsといった言語などの分野において、自社エンジニアたちがプロジェクトリーダーや主要なコミッター となっています。

source: In broad terms, OSPOs provide three types of strategic guidance in Stage 4.
ja_jp: 大まかに言えば、OSPO は「ステージ4」で3種類の戦略的ガイダンスを提供します。

source: In close collaboration with Porsche Digital, the OSPO also enables and promotes open source contributions from the Porsche ecosystem.
ja_jp: また、同社 OSPO は、Porsche Digital と密に連携し、Porsche のエコシステムからのオープンソースへのコントリビューションを可能にし、推進しています。

source: In contrast is Red Hat, the first open source company to go public.
ja_jp: 対照的なのは、オープンソース企業として最初に株式公開した Red Hat です。

source: In general, an organization forms an OSPO when it realizes that its people are consuming open source products and code across nearly all engineering and development departments and functions.
ja_jp: 一般的に、組織がOSPOを結成するのは、ほぼすべてのエンジニアリングおよび開発部門とそれらの機能にわたって、人々がオープンソースの製品とコードを消費していることに気づいたときです。

source: In larger organizations, multiple business units might develop different approaches to open source, each with a different technology culture; and pure digital technology companies are far more likely to consume and contribute to OSS early and have greater exposure to open source technologies and concepts.
ja_jp: 規模の大きな組織では、複数のビジネスユニットがあり、それぞれ異なった技術的カルチャーでオープンソースへの異なるアプローチを編み出す可能性がありますし、純粋なデジタル技術中心の企業では、早期から OSS を使用したりコントリビュートしたり、オープンソースの技術やコンセプトに触れる機会がはるかに多くなるでしょう。

source: In most of these instances, a few engineers are actively seeking out open source while the rest of the engineering organization may use open source coincidentally but does not view its activities as dependent on open source.
ja_jp: こういった段階のほとんどにおいて、少数のエンジニアが積極的にオープンソースを探し求めている一方でエンジニアリング組織のその他のメンバーたちは ― たまたまオープンソースを使用していたとしても ― その活動がオープンソースに依存しているとは見なしていません。

source: In my history, people have come to us and said, “We want to use this software!” and we said, “The software is solid, but the community is not healthy.
ja_jp: 過去こんなことがありました。私たちのところに「このソフトウェアを使いたいんですが!」と誰かが駆け込んできます。そしてこんな会話をします。「そのソフトウェアはしっかりしているけど、コミュニティは健全ではないね。

source: In no event will the Linux Foundation and its authors, contributors, and sponsors be liable to any other party for lost profits or any form of indirect, special, incidental, or consequential damages of any character from any causes of action of any kind with respect to this report, whether based on breach of contract, tort (including negligence), or otherwise, and whether or not they have been advised of the possibility of such damage.
ja_jp: In no event will the Linux Foundation and its authors, contributors, and sponsors be liable to any other party for lost profits or any form of indirect, special, incidental, or consequential damages of any character from any causes of action of any kind with respect to this report, whether based on breach of contract, tort (including negligence), or otherwise, and whether or not they have been advised of the possibility of such damage. The Linux Foundation およびその著者、コントリビューター、スポンサーは、本レポートに関して、契約違反、不法行為（過失を含む）、またはその他に基づくか否かにかかわらず、またそのような損害の可能性について事前に知らされていたか否かにかかわらず、逸失利益および、あらゆる形態の間接的、特別的、付随的、派生的損害に対して責任を負いません。

source: In other words, community health and behaviors have become key determinants in the company’s technology investments.
ja_jp: 言い換えると、コミュニティの健全性や振る舞いがこの企業の技術投資における重要な決定要因となっている、ということになります。

source: In other words, nearly every organization is using open source.
ja_jp: 言い換えれば、ほぼすべての組織がオープンソースを使用している、ということです。

source: In our fourth TODO Group survey of open source practices, we found a positive evolution of the OSPO toward more professional organizations with greater dedicated funding and resources.
ja_jp: オープンソースへの取り組みに関する TODO Group として実施した4回目のサーベイでは、より多くの資金や活動リソースの提供があり、OSPOがより専門的な組織へとよい形で進化していることが明らかとなりました。

source: In our interviews with OSPO leaders, we saw universal expansion of the role of OSPO, budgets for OSPOs, and staff dedicated to promoting open source at organizations.
ja_jp: OSPO のリーダーたちとのインタビューにおいて、私たちはOSPO の機能、OSPO への予算、組織におけるオープンソースの推進を専業とするスタッフ、といったことの普遍的な拡大を観察しました。

source: In partnership with:
ja_jp: 協力：

source: In reality, any organization with a considerable IT function and an advanced online or application-centric presence uses open source, because of the ubiquity of open source throughout the technology stack—from Linux servers and MySQL databases to programming languages like Node.js and Python and front-end frameworks like React and Vue.js.
ja_jp: 実際には、かなりのIT機能を持ち、高度なオンラインまたはアプリケーション軸でプレゼンスを持つすべての組織がオープンソースを使用しています。その理由は、技術スタック全体を見るとオープンソースがいたるところ ― Linux サーバや MySQL データベースにはじまり、Node.js や Python などのプログラミング言語、さらには React や Vue.js などのフロントエンドフレームワークといったあらゆるところ ― に存在していると点にあります。

source: In short, what OSPOs focus on has evolved over time to match their new role.
ja_jp: 端的に言えば、OSPO が焦点を当てるものは、組織の新たな任務に合わせ時代とともに進化してきた、ということです。

source: In such programs, developers learn:
ja_jp: このようなプログラムで、開発者たちは次のことを学びます。

source: In technology organizations, open source valuers were an integral part of the culture and often embedded in the products; conversations often went well beyond license compliance toward exploration of how these companies could leverage open source communities to speed up and improve product development while maintaining a commercial edge.
ja_jp: テック企業において、オープンソースの価値はカルチャーとして不可欠なものであり、しばしば製品へと組み入れられました。そこでなされる会話は、ライセンスの遵守ということだけではなく、さらに進んで「どうすればオープンソース コミュニティを活用して 、商業的優位性を維持しながら製品開発を加速し、改善していけるのか」 、といったことにも及びました。

source: In the 2020 survey, respondents ranked compliance as the top benefit of OSPOs of larger companies, and compliance remains the second leading benefit for medium-size companies.
ja_jp: 2020年の調査では、回答者は大企業における OSPO のメリットとして「コンプライアンス」をトップとしていました。中規模企業でもコンプライアンスは2番目に優れたメリットとなっています

source: In the Apache Lucene/Solr project, which powers core functions of the Bloomberg platform, a company employee is on the project management committee.
ja_jp: Bloomberg のプラットフォームの中核機能に力を与えている Apache Lucene/Solr については、 プロジェクト マネジメント コミッティに同社社員が参加しています。

source: In the European Union, many of the major automotive companies have formed a loose OSPO coordination consortium that prioritizes key OSS initiatives for automotive and collaborates on software development for those initiatives.
ja_jp: EUでは、主要な自動車メーカーの多くが、OSPO の「緩い」連携のためのコンソーシアム ― 自動車向けの主要な OSS のイニシアチブに優先付けをし、それらのイニシアチブに対するソフトウェア開発でコラボレーションするコンソーシアム ― を形成しました。

source: In the open-ended sections of the survey, respondents highlighted many valuable benefits of OSPOs, such as improved code quality, better leverage of OSS tools like continuous integration/continuous delivery (CI/CD) pipelines, and a positive linkage between external collaboration (open source) and internal collaboration (inner source).
ja_jp: アンケートの自由回答箇所では、OSPOがもたらす多くのメリットを際立っていました。コードの品質向上、継続的インテグレーション/継続的デリバリ（CI/CD）パイプラインのようなOSSツールのより良い活用、外部コラボレーション（オープンソース）と内部コラボレーション（インナーソース）間の有益な結合、といったことがここで挙げられていました。

source: In the very first year, the company’s employees tallied 13 contributions.
ja_jp: まさに最初となった年には、Comcast 社員によるコントリビューションは13件を数えました。

source: In these companies, open source is often well understood and used in some capacity by the vast majority of developers.
ja_jp: これらの企業では、大多数の開発者たちがオープンソースをある程度よく理解し、うまく使っている傾向が見られます。

source: In this report, we detail each of these stages and develop a handful of archetypes of OSPO organizations.
ja_jp: 本レポートでは、これらの各段階を詳細に説明し、OSPO 組織の原型（Archeitype）をいくつか考案しました。

source: In this role, the OSPO becomes an internal technology consultant to the CTO and the in-house expert on OSS.
ja_jp: この役割においては、OSPO は CTO の内部技術コンサルタント、そしてOSSに関する社内の専門家になっています。

source: In this role, where the OSPO has a multimillion-dollar foundation budget, the strategic importance of participating in OSS ecosystem formation and growth parallels the monetary investment in foundations and nonprofits.
ja_jp: この状況では、OSPO が数百万ドルレベルの財団向け予算を持つことが役割として期待され、OSS エコシステムの形成と成長に参加することの戦略的重要性が、財団や非営利団体への金銭的投資と連動したものとなっています。

source: In this stage of the life cycle, OSPOs begin exploring how to streamline processes for developers to consume OSS.
ja_jp: ライフサイクルとしてのこの段階で、OSPO は開発者が OSS を消費するためのプロセスをいかにして合理化するか、について模索し始めるようになります。

source: In time, Bloomberg’s OSPO evolved not only to foster community participation, but also to provide necessary guidance and support to teams thinking about launching open source projects.
ja_jp: そして Bloomberg の OSPO は、コミュニティへの参加を促進するだけでなく、オープンソース プロジェクトの立ち上げを考えているチームへ必要なガイダンスやサポートを提供するものとして進化しました。

source: Incentivize developers to work on OSS projects critical to their operations, to the degree that developers become highly active contributors or primary maintainers
ja_jp: 自社の運営にとって非常に重要な OSS プロジェクトに開発者が取り組み、非常にアクティブなコントリビューターや主要メンテナーとなれるよう、彼らにインセンティブを提供する

source: Increasingly, that means empowering enterprises and organizations to create effective OSPO programs.
ja_jp: そしてそれは、企業や組織に効果的な OSPO プログラム を創出する力を与えることを段々と意味するようにもなってきています。

source: Increasingly, this value extends to the work of foundations and nonprofits, as those realms become important neutral spaces in open source.
ja_jp: こういった領域がオープンソースにおける重要な「中立的空間」となるにつれ、この価値が次第に財団（Foundation）や非営利団体（Non-profit）の活動にまで広がっていきます。

source: Industry Collaborative
ja_jp: 業界「内」で協調的

source: Industry Collaborative 19
ja_jp: 業界「内」で協調的 19

source: Initially composed of just Peters and one colleague, the Porsche OSPO has since grown with a roadmap for backing and funding from upper level management.
ja_jp: また当初は Peters と同僚1人で構成されていた Porsche の OSPO でしたが、そこから上位マネジメントからの支持やファンドを得るためのロードマップを片手に成長してきました。

source: Initially focused on license compliance in the early days, the OSPO often plays a broader role inside organizations today.
ja_jp: 当初 OSPO はライセンス コンプライアンスに重点を置いていましたが、今日では組織内でより幅広い役割を担うようになってきています。

source: Initiate and host, or act as primary sponsors of, OSS projects
ja_jp: OSSプロジェクトを自らで立ち上げてホストする、もしくはそのプロジェクトの主要スポンサーとなる

source: Inner source advocates seek to form internal communities that maintain and develop software that multiple teams can use for multiple applications.
ja_jp: 「インナーソース」の支持者たちは、社内にある多くのチームがいろいろなアプリケーションに使えるソフトウェアをメンテナンス、および開発するような社内コミュニティを形成することを目論みます。

source: Inner source often collaborates closely with or even works under OSPO management.
ja_jp: インナーソースは、しばしば OSPO のマネジメントのもとで密接にコラボレーションし、業務をともにすることもあるのです。

source: Inner sourcing was, in effect, an endorsement of open source practices and an attempt to adopt those that would accelerate software innovation inside companies.
ja_jp: 「インナーソーシング」とは、事実上、オープンソースのプラクティスを支持することであり、そして企業内のソフトウェア イノベーションを加速させるようなプラクティスを取り入れようとする試みでもありました。

source: Introduction
ja_jp: はじめに

source: It built its entire business practice on OSS, compressing its maturity life cycle and, in effect, making its entire company something of an OSPO.
ja_jp: 彼らは、成熟段階に至るライフサイクルを短縮させ、事実上会社全体を OSPO のようなものにしつつ、OSS 上にビジネス プラクティス全体を構築していったのです。

source: It is a place to share experiences, develop best practices and guidance as well as work on common tooling to improve OSPO adoption and education worldwide across sectors.
ja_jp: TODO グループは経験を共有し、ベストプラクティスやガイダンスを開発する場であり、また業界の区分を越えてワールドワイドで OSPO の採用を広げ、教育をよりよいものにしていくための共通的ツールづくりに取り組む場でもあります。

source: It may also provide guidance on judging the health of OSS projects as part of its criteria for deciding which OSS to use in the organization’s technology stack or infrastructure.
ja_jp: 組織の技術スタックもしくはインフラでどの OSS を使用するか、を決定する基準の一部として、OSS プロジェクトの健全性を判断するガイダンスを提供する場合もあります。

source: It soon became clear that open source was not just a viable option but a critical path to technology innovation.
ja_jp: オープンソースは実行可能な選択肢であるだけでなく、イノベーションへの重要な道筋であることもすぐに明らかになりました。

source: It was about enablement.
ja_jp: 機能させること（Enablement）、でした。

source: It was exciting to see other companies blogging about their use of Kuberhealthy and how it had helped them.
ja_jp: 他の企業が Kuberhealthy を使用し、それがどのように彼らの助けになったかについて書かれているブログ記事を見てとても心が躍りました。

source: It was the fourth consecutive year the TODO Group has run the survey.
ja_jp: TODO グループはこれまで同調査を実施してきており、今回の調査が連続して4年目のものとなりました。

source: Its engineers work with and contribute to many open source communities in networking, cloud, and other key areas simply because they know that when building with open source it results in better outcomes and increased interoperability—for the community and VMware’s customers.
ja_jp: 同社エンジニアは、ネットワーキング、クラウド、その他の主要領域において多くのオープンソース コミュニティと協働し、コントリビューションもしています。オープンソースで構築をすれば、結果としてより良い成果と相互運用性の向上 ― コミュニティや VMWare の顧客にとって― につながることを知っているからです。

source: Its role can include setting code use, distribution, selection, auditing, and other policies, as well as training developers, ensuring legal compliance, and promoting and building community engagement that benefits the organization strategically.
ja_jp: その役割は、ソースコードの使用、配布、選定、監査といったことに加え、開発者トレーニング、法令遵守の確保、その組織に戦略的な恩恵をもたらすための OSS コミュニティへのエンゲージメントの構築や促進、といったその他のポリシーの設定も含むことがあります。

source: It’s important that an organization brings its best.
ja_jp: 組織が最善を尽くす、ということが重要です。

source: Kevin P. Fleming (Former Head of Technology Community Engagement, Bloomberg), Zoom interview with author, Sept.
ja_jp: Kevin P.Fleming（Former Head of Technology Community Engagement、Bloomberg）、著者によるZoomインタビュー、

source: Kevin P. Fleming (Former Head, Technology Community Engagement, Bloomberg), Zoom interview with author, Sept.
ja_jp: Kevin P.Fleming（Former Head of Technology Community Engagement、Bloomberg）、著者によるZoomインタビュー、

source: Kevin P. Fleming (former Head, Technology Community Engagement, Bloomberg), Zoom interview with author, Sept.
ja_jp: Kevin P.Fleming（Former Head of Technology Community Engagement、Bloomberg）、著者によるZoomインタビュー、

source: Key Survey Findings
ja_jp: 主な調査結果

source: Key Survey Findings 8
ja_jp: 主な調査結果 8

source: Lay out best practices in interacting with OSS projects such as how to request features, file bug reports, and contribute basic code
ja_jp: OSSプロジェクトとの連携におけるベストプラクティス ― フィーチャー リクエスト（機能リクエスト）」の仕方、バグレポートの提出の仕方、基本コード（Basic code）のコントリビュートの仕方など ― が実践できるよう準備する

source: Maintaining open source license compliance reviews and oversight dropped from 68% to 59% of survey participants citing it as a primary responsibility.
ja_jp: オープンソースライセンスのコンプライアンスのレビューや監視の維持を主な責務として挙げた回答者の割合は、68%から59%に低下しました。

source: Make not mistake - the need for speed is driving Porsche’s OSPO.
ja_jp: そして、間違いなく、スピードに対する必要が Porsche の OSPO をドライブしています。

source: Manage legal risk and licenses, creating new procedures and documentation to ensure employees use OSS according to its license terms and that the organization’s OSS consumption is not putting it at legal risk
ja_jp: 法的リスクやライセンスを管理し、社員がライセンス条項に従って OSS を使用するのを確実にするべく、新しい手順やドキュメントを作成し、組織がOSSを消費することによって法的リスクにさらされないようにする

source: Managing Legal Risks and Licenses
ja_jp: リーガルリスクとライセンスを管理する

source: Many businesses also have internal financial charging systems between units, further blurring the line between a paid service and an internal service.
ja_jp: また、多くの企業では、社内ユニット間で内部課金システムがあり（外部向けの）有料サービスと内部向けサービスの境界がさらに曖昧になってきます。

source: Maybe we should consider using an alternative because we might find ourselves in a place where we have to switch to an alternative in the future, and it will cost a lot more.”
ja_jp: これだと将来別のものにスイッチしなくちゃいけない状況になりそうだし、それもコストが大きくかかってしまうだろうし、代替策を考えるべきかも知れないよ。」

source: Metrics
ja_jp: メトリック

source: Michael Picht (Chief Architect, Open Source Program Office, SAP), Zoom interview with author, Nov.
ja_jp: Michael Picht（Chief Architect,Open Source Program Office,SAP）,著者による Zoom インタビュー、

source: Modern cloud native applications, almost by default, use open source systems for container orchestration, observability, data storage, messaging, and more.
ja_jp: モダンなクラウドネイティブ アプリケーションは、ほぼデフォルトの状態でコンテナオーケストレーション、可観測性、データストレージ、メッセージングといった機能としてオープンソースのシステムを使用しています。

source: More advanced open source organizations may have metrics around successful growth of projects launched from or partly created by their own engineering teams.
ja_jp: より高度なオープンソースな組織では、自社エンジニアリングチームが立ち上げたり、部分的にでも作り出したプロジェクトの「成功した成長」に関するメトリックを持っていることもあります。

source: More than a couple decades into the OSPO movement, the role of the OSPO has grown to become a central source of expertise and a strong voice in developing and implementing technology strategy at the world’s forward-thinking companies.
ja_jp: OSPO の動きが出てきてから20年以上が経過し、OSPO の役割は発展してきました。世界の先見の明のある企業において、その役割は、技術戦略の策定、その実装において専門知識や強い発言力を持つ中核的存在になってきています。

source: More than many companies, Volkswagen is aggressively driving to foster open source, even to the point of creating entirely separate companies that focus on software innovation for the industry.
ja_jp: 他の多くの企業と比べても、Volkswagen グループはアグレッシブにオープンソースを推進しており、業界のソフトウェア イノベーションに焦点を当てた完全に独立した企業を設立するまでになっています。

source: Most OSPOs rely on back-of-the-envelope metrics to evaluate project behavior such as:
ja_jp: ほとんどの OSPO が、プロジェクトの挙動を評価するために、次のような手軽なメトリックをたよりにしています。

source: Most of the OSPOs we spoke with cited recruitment of new engineering talent and retention of existing talent as a key motivation of the open source effort.
ja_jp: 私たちが話をした OSPO の大半が、オープンソースの取り組みでの主なモチベーションとして、エンジニアリング人材の新規採用と既存人材の定着を挙げていました。

source: Most of the firm’s focus prior to 2018 was on ensuring that engineers choosing to use open source did so in a compliant manner.
ja_jp: 同社の2018年以前の重点は、オープンソースの使用を選択するエンジニアたちがオープンソースをコンプライアンスの対応をした上で使えるようにすることでした。

source: Most prominent technology infrastructure firms (e.g., Amazon, VMware, Cisco) and consumer technology companies (e.g., Apple, Google, Facebook, and Twitter) have OSPOs or formal open source programs.
ja_jp: 非常に卓越したインフラ系テック企業（例：Amazon、VMware、Cisco）やコンシューマーテック系企業（例：Apple、Google、Facebook、Twitter）は、OSPO や公式のオープンソースプログラムを擁しています。

source: My mandate wasn’t about compliance.
ja_jp: 私のすべきだったのはコンプライアンス（Compliance）ではなく、

source: Nithya Ruff (OSPO,Comcast), Zoom interview with author,Sept.
ja_jp: Nithya Ruff（OSPO、Comcast）、著者によるZoomインタビュー、

source: Nithya Ruff, who is a Comcast fellow and the head of open source at Comcast from 2017 on and serves as board chair of the Linux Foundation, was hired to help drive open source engagement across the company.
ja_jp: Nithya Ruff ― 2017年から Comcast フェロー、兼オープンソース部門の長であり、Linux Foundation のボードチェアも務める ― は全社的なオープンソース エンゲージメントの推進のために同社に採用されました。

source: Notes Ruff, “A lot of our engineers love being able to contribute to OSS, and being able to speak at conferences, and publish papers and blogs.
ja_jp: Ruff はこうも言います。「当社のエンジニアの多くは、OSSに貢献できること、カンファレンスでスピーチできること、書籍やブログを公開できることを好んでいます。

source: Number of Dedicated OSS Developers
ja_jp: OSS専任の開発者数

source: Number of Developers
ja_jp: 開発者数

source: Number of FTEs in OSPO
ja_jp: OSPO のフルタイム社員数

source: OSPO Age
ja_jp: OSPO の年齢

source: OSPO Archetypes
ja_jp: OSPO の「原型（Archetypes）」

source: OSPO Archetypes 18
ja_jp: OSPOの「原型（Archetypes）」 18

source: OSPO Case Studies
ja_jp: OSPO ケーススタディ

source: OSPO Case Studies 22
ja_jp: OSPO ケーススタディ 22

source: OSPO Checklist
ja_jp: OSPO チェックリスト

source: OSPO Checklist 30
ja_jp: OSPO チェックリスト 30

source: OSPO Personas
ja_jp: OSPOのペルソナ

source: OSPO Prevalence by Industry 2018–2021
ja_jp: 2018-2021年の産業別 OSPO 普及率

source: OSPOs are also growing more professional through formal structures.
ja_jp: OSPOは形式的な組織構造に基づくことから、より専門的なものにもなってきています。

source: OSPOs are more than just gatekeepers and mentors for project formation and launch; they educate project creators on the requirements for cultivating a healthy open source ecosystem, and they coach project leads to prepare them for a more public leadership role required of an OSS project.
ja_jp: OSPO は、プロジェクトの組成、立ち上げのためのゲートキーパーやメンターであるだけでなく、健全なオープンソース エコシステムを育成する上での要諦についてプロジェクト創始者たちを教育したり、OSSプロジェクトに求められる、より公的な役割としてリーダーシップを発揮できるようにプロジェクトリーダーたちをコーチしたりもします。

source: OSPOs in Stage 2 create such internal mechanisms as ambassadors who promote usage of approved OSS products, educational programs on good OSS hygiene, and technical training or tuition reimbursement for skill building and certification in OSS.
ja_jp: ステージ2の段階にある OSPO は、承認された OSS 製品の使用を推進する「アンバサダー」として、良好な OSS の衛生環境に関する教育プログラム、OSS におけるスキルアップと認定のための技術トレーニングや学費負担といった組織内の仕組みを作り上げていきます。

source: OSPOs in this archetype view open source as a platform not only for general technology development, but as a way for their specific industry to become more efficient through sharing costs and innovation for industry-specific needs.
ja_jp: この原型の OSPO は、プラットフォームとしてのオープンソースを、一般的な技術開発の目的だけでなく、業界特有のニーズに合ったコストの共有やイノベーションを通じて、その業界の効率性を高める手段としても捉えています。

source: OSPOs serve to educate developers and other employees about OSS by fostering best OSS practices and participation in OSS communities to make developers more efficient.
ja_jp: また、OSPO は開発者たちにより効率的に機能してもらえるよう、OSS のベストプラクティスを育んだり OSS コミュニティへ参加したりすることで、開発者やその他の社員が OSS を学ぶ機会を提供する役割を担っています。

source: OSPOs that work closely with CTOs and company strategists to map open source projects and capabilities
ja_jp: CTO や企業戦略担当者たちと密接に協力して、オープンソース プロジェクトとケイパビリティを対応付けるOSPO。比較的数が少ない

source: OSPOs will have more resources available to automate OSPO manual tasks (in areas like compliance or due diligence) and larger OSPO teams to meet the needs of developers who spend more time in open source.
ja_jp: 今後 OSPO は、今マニュアルで実施している OSPO のタスク（コンプライアンスやデュー ディリジェンスなどの領域）を自動化するべく、多くのリソースを持てるようになり、オープンソースに多くの時間を費やす開発者の要望を満たすべく、より大きな OSPO チームになっていくことでしょう。

source: OSPOs with this archetype are eager to work on foundational technology problems that cross industries.
ja_jp: この原型をもつ OSPO は、産業をまたがる基礎的な技術問題に熱心に取り組みます。

source: On the front-end of applications, developers rely heavily on open source libraries and frameworks.
ja_jp: アプリケーションのフロントエンドにおいても、開発者たちはオープンソースのライブラリやフレームワークに大きく依存しています。

source: On these two axes, the seeds of the Open Source Program Office (OSPO) germinated into formal programs that facilitated compliant open source use.
ja_jp: この2つの軸において、Open Source Program Office（OSPO）の種は、コンプライアンスに則ったオープンソースの使用を促進する正式なプログラムとして発芽したのです。

source: One of our big goals is to see if we can drive and set open standards — for example, an automotive open source standard,” says Peters.
ja_jp: 私たちの大きな目標の1つに、オープンな標準 ― 例えば自動車のオープンソースの標準 ― をドライブし、規定できるのかどうかを見極めること、があります。」と、Peters は言っています。

source: One of the OSPO’s primary goals today is to help with best practices in coaching and how to be a good open source citizen.
ja_jp: 今日の OSPO の主な目標の1つは、コーチングのベストプラクティスと、どうやって優れた「オープンソース市民（Open source citizen）」になるか、その手助けをすることだと思います。

source: One of the most important roles of any OSPO is to make sure developers understand the implications of different license choices.”
ja_jp: OSPO の最も重要な役割の1つは、さまざまなライセンス選択の意味を開発者たちが理解することを確かなものにすることです。」
